SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_mpcp.h
/**************************************************************************//**
 * @file
 * @brief EFR32FG25 MPCP register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2021 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32FG25_MPCP_H
#define EFR32FG25_MPCP_H
#define MPCP_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32FG25_MPCP MPCP
 * @{
 * @brief EFR32FG25 MPCP Register Declaration.
 *****************************************************************************/

/** MPCP FIFOIN Register Group Declaration. */
typedef struct {
  __IOM uint32_t FIFOIN;                             /**< New Register                                       */
} MPCP_FIFOIN_TypeDef;

/** MPCP Register Declaration. */
typedef struct {
  __IM uint32_t       IPVERSION;                /**< IP Version ID                                      */
  __IOM uint32_t      EN;                       /**< Module Enable                                      */
  __IOM uint32_t      SWRST;                    /**< Software Reset                                     */
  __IOM uint32_t      CONNECT;                  /**< New Register                                       */
  __IOM uint32_t      DISCLK;                   /**< Disable Clocks                                     */
  uint32_t            RESERVED0[3U];            /**< Reserved for future use                            */
  MPCP_FIFOIN_TypeDef FIFOIN[4U];               /**<                                                    */
  uint32_t            RESERVED1[4U];            /**< Reserved for future use                            */
  __IM uint32_t       FIFOOUT;                  /**< New Register                                       */
  uint32_t            RESERVED2[23U];           /**< Reserved for future use                            */
  uint32_t            RESERVED3[1U];            /**< Reserved for future use                            */
  uint32_t            RESERVED4[7U];            /**< Reserved for future use                            */
  __IOM uint32_t      FMTOUT;                   /**< New Register                                       */
  uint32_t            RESERVED5[79U];           /**< Reserved for future use                            */
  __IOM uint32_t      CTRL1;                    /**< New Register                                       */
  __IOM uint32_t      CTRL2;                    /**< New Register                                       */
  __IOM uint32_t      CTRL3;                    /**< New Register                                       */
  __IOM uint32_t      CTEA;                     /**< New Register                                       */
  __IOM uint32_t      CTEB;                     /**< New Register                                       */
  __IOM uint32_t      CTEC;                     /**< New Register                                       */
  __IOM uint32_t      BYPASS;                   /**< New Register                                       */
  __IM uint32_t       STAT;                     /**< New Register                                       */
  __IOM uint32_t      CTRL4;                    /**< New Register                                       */
  __IOM uint32_t      IF;                       /**< New Register                                       */
  __IOM uint32_t      IEN;                      /**< New Register                                       */
  __IOM uint32_t      CTRL5;                    /**< New Register                                       */
  __IM uint32_t       MINMAXI;                  /**< New Register                                       */
  __IM uint32_t       MINMAXQ;                  /**< New Register                                       */
  __IM uint32_t       MINMAXIDX;                /**< New Register                                       */
  uint32_t            RESERVED6[881U];          /**< Reserved for future use                            */
  __IM uint32_t       IPVERSION_SET;            /**< IP Version ID                                      */
  __IOM uint32_t      EN_SET;                   /**< Module Enable                                      */
  __IOM uint32_t      SWRST_SET;                /**< Software Reset                                     */
  __IOM uint32_t      CONNECT_SET;              /**< New Register                                       */
  __IOM uint32_t      DISCLK_SET;               /**< Disable Clocks                                     */
  uint32_t            RESERVED7[3U];            /**< Reserved for future use                            */
  MPCP_FIFOIN_TypeDef FIFOIN_SET[4U];           /**<                                                    */
  uint32_t            RESERVED8[4U];            /**< Reserved for future use                            */
  __IM uint32_t       FIFOOUT_SET;              /**< New Register                                       */
  uint32_t            RESERVED9[23U];           /**< Reserved for future use                            */
  uint32_t            RESERVED10[1U];           /**< Reserved for future use                            */
  uint32_t            RESERVED11[7U];           /**< Reserved for future use                            */
  __IOM uint32_t      FMTOUT_SET;               /**< New Register                                       */
  uint32_t            RESERVED12[79U];          /**< Reserved for future use                            */
  __IOM uint32_t      CTRL1_SET;                /**< New Register                                       */
  __IOM uint32_t      CTRL2_SET;                /**< New Register                                       */
  __IOM uint32_t      CTRL3_SET;                /**< New Register                                       */
  __IOM uint32_t      CTEA_SET;                 /**< New Register                                       */
  __IOM uint32_t      CTEB_SET;                 /**< New Register                                       */
  __IOM uint32_t      CTEC_SET;                 /**< New Register                                       */
  __IOM uint32_t      BYPASS_SET;               /**< New Register                                       */
  __IM uint32_t       STAT_SET;                 /**< New Register                                       */
  __IOM uint32_t      CTRL4_SET;                /**< New Register                                       */
  __IOM uint32_t      IF_SET;                   /**< New Register                                       */
  __IOM uint32_t      IEN_SET;                  /**< New Register                                       */
  __IOM uint32_t      CTRL5_SET;                /**< New Register                                       */
  __IM uint32_t       MINMAXI_SET;              /**< New Register                                       */
  __IM uint32_t       MINMAXQ_SET;              /**< New Register                                       */
  __IM uint32_t       MINMAXIDX_SET;            /**< New Register                                       */
  uint32_t            RESERVED13[881U];         /**< Reserved for future use                            */
  __IM uint32_t       IPVERSION_CLR;            /**< IP Version ID                                      */
  __IOM uint32_t      EN_CLR;                   /**< Module Enable                                      */
  __IOM uint32_t      SWRST_CLR;                /**< Software Reset                                     */
  __IOM uint32_t      CONNECT_CLR;              /**< New Register                                       */
  __IOM uint32_t      DISCLK_CLR;               /**< Disable Clocks                                     */
  uint32_t            RESERVED14[3U];           /**< Reserved for future use                            */
  MPCP_FIFOIN_TypeDef FIFOIN_CLR[4U];           /**<                                                    */
  uint32_t            RESERVED15[4U];           /**< Reserved for future use                            */
  __IM uint32_t       FIFOOUT_CLR;              /**< New Register                                       */
  uint32_t            RESERVED16[23U];          /**< Reserved for future use                            */
  uint32_t            RESERVED17[1U];           /**< Reserved for future use                            */
  uint32_t            RESERVED18[7U];           /**< Reserved for future use                            */
  __IOM uint32_t      FMTOUT_CLR;               /**< New Register                                       */
  uint32_t            RESERVED19[79U];          /**< Reserved for future use                            */
  __IOM uint32_t      CTRL1_CLR;                /**< New Register                                       */
  __IOM uint32_t      CTRL2_CLR;                /**< New Register                                       */
  __IOM uint32_t      CTRL3_CLR;                /**< New Register                                       */
  __IOM uint32_t      CTEA_CLR;                 /**< New Register                                       */
  __IOM uint32_t      CTEB_CLR;                 /**< New Register                                       */
  __IOM uint32_t      CTEC_CLR;                 /**< New Register                                       */
  __IOM uint32_t      BYPASS_CLR;               /**< New Register                                       */
  __IM uint32_t       STAT_CLR;                 /**< New Register                                       */
  __IOM uint32_t      CTRL4_CLR;                /**< New Register                                       */
  __IOM uint32_t      IF_CLR;                   /**< New Register                                       */
  __IOM uint32_t      IEN_CLR;                  /**< New Register                                       */
  __IOM uint32_t      CTRL5_CLR;                /**< New Register                                       */
  __IM uint32_t       MINMAXI_CLR;              /**< New Register                                       */
  __IM uint32_t       MINMAXQ_CLR;              /**< New Register                                       */
  __IM uint32_t       MINMAXIDX_CLR;            /**< New Register                                       */
  uint32_t            RESERVED20[881U];         /**< Reserved for future use                            */
  __IM uint32_t       IPVERSION_TGL;            /**< IP Version ID                                      */
  __IOM uint32_t      EN_TGL;                   /**< Module Enable                                      */
  __IOM uint32_t      SWRST_TGL;                /**< Software Reset                                     */
  __IOM uint32_t      CONNECT_TGL;              /**< New Register                                       */
  __IOM uint32_t      DISCLK_TGL;               /**< Disable Clocks                                     */
  uint32_t            RESERVED21[3U];           /**< Reserved for future use                            */
  MPCP_FIFOIN_TypeDef FIFOIN_TGL[4U];           /**<                                                    */
  uint32_t            RESERVED22[4U];           /**< Reserved for future use                            */
  __IM uint32_t       FIFOOUT_TGL;              /**< New Register                                       */
  uint32_t            RESERVED23[23U];          /**< Reserved for future use                            */
  uint32_t            RESERVED24[1U];           /**< Reserved for future use                            */
  uint32_t            RESERVED25[7U];           /**< Reserved for future use                            */
  __IOM uint32_t      FMTOUT_TGL;               /**< New Register                                       */
  uint32_t            RESERVED26[79U];          /**< Reserved for future use                            */
  __IOM uint32_t      CTRL1_TGL;                /**< New Register                                       */
  __IOM uint32_t      CTRL2_TGL;                /**< New Register                                       */
  __IOM uint32_t      CTRL3_TGL;                /**< New Register                                       */
  __IOM uint32_t      CTEA_TGL;                 /**< New Register                                       */
  __IOM uint32_t      CTEB_TGL;                 /**< New Register                                       */
  __IOM uint32_t      CTEC_TGL;                 /**< New Register                                       */
  __IOM uint32_t      BYPASS_TGL;               /**< New Register                                       */
  __IM uint32_t       STAT_TGL;                 /**< New Register                                       */
  __IOM uint32_t      CTRL4_TGL;                /**< New Register                                       */
  __IOM uint32_t      IF_TGL;                   /**< New Register                                       */
  __IOM uint32_t      IEN_TGL;                  /**< New Register                                       */
  __IOM uint32_t      CTRL5_TGL;                /**< New Register                                       */
  __IM uint32_t       MINMAXI_TGL;              /**< New Register                                       */
  __IM uint32_t       MINMAXQ_TGL;              /**< New Register                                       */
  __IM uint32_t       MINMAXIDX_TGL;            /**< New Register                                       */
} MPCP_TypeDef;
/** @} End of group EFR32FG25_MPCP */

/**************************************************************************//**
 * @addtogroup EFR32FG25_MPCP
 * @{
 * @defgroup EFR32FG25_MPCP_BitFields MPCP Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for MPCP IPVERSION */
#define _MPCP_IPVERSION_RESETVALUE            0x00000001UL                              /**< Default value for MPCP_IPVERSION            */
#define _MPCP_IPVERSION_MASK                  0xFFFFFFFFUL                              /**< Mask for MPCP_IPVERSION                     */
#define _MPCP_IPVERSION_IPVERSION_SHIFT       0                                         /**< Shift value for MPCP_IPVERSION              */
#define _MPCP_IPVERSION_IPVERSION_MASK        0xFFFFFFFFUL                              /**< Bit mask for MPCP_IPVERSION                 */
#define _MPCP_IPVERSION_IPVERSION_DEFAULT     0x00000001UL                              /**< Mode DEFAULT for MPCP_IPVERSION             */
#define MPCP_IPVERSION_IPVERSION_DEFAULT      (_MPCP_IPVERSION_IPVERSION_DEFAULT << 0)  /**< Shifted mode DEFAULT for MPCP_IPVERSION     */

/* Bit fields for MPCP EN */
#define _MPCP_EN_RESETVALUE                   0x00000000UL                              /**< Default value for MPCP_EN                   */
#define _MPCP_EN_MASK                         0x00000003UL                              /**< Mask for MPCP_EN                            */
#define MPCP_EN_EN                            (0x1UL << 0)                              /**< Module Enable                               */
#define _MPCP_EN_EN_SHIFT                     0                                         /**< Shift value for MPCP_EN                     */
#define _MPCP_EN_EN_MASK                      0x1UL                                     /**< Bit mask for MPCP_EN                        */
#define _MPCP_EN_EN_DEFAULT                   0x00000000UL                              /**< Mode DEFAULT for MPCP_EN                    */
#define MPCP_EN_EN_DEFAULT                    (_MPCP_EN_EN_DEFAULT << 0)                /**< Shifted mode DEFAULT for MPCP_EN            */
#define MPCP_EN_DISABLING                     (0x1UL << 1)                              /**< Disablement Busy Status                     */
#define _MPCP_EN_DISABLING_SHIFT              1                                         /**< Shift value for MPCP_DISABLING              */
#define _MPCP_EN_DISABLING_MASK               0x2UL                                     /**< Bit mask for MPCP_DISABLING                 */
#define _MPCP_EN_DISABLING_DEFAULT            0x00000000UL                              /**< Mode DEFAULT for MPCP_EN                    */
#define MPCP_EN_DISABLING_DEFAULT             (_MPCP_EN_DISABLING_DEFAULT << 1)         /**< Shifted mode DEFAULT for MPCP_EN            */

/* Bit fields for MPCP SWRST */
#define _MPCP_SWRST_RESETVALUE                0x00000000UL                              /**< Default value for MPCP_SWRST                */
#define _MPCP_SWRST_MASK                      0x00000003UL                              /**< Mask for MPCP_SWRST                         */
#define MPCP_SWRST_SWRST                      (0x1UL << 0)                              /**< Software Reset Command                      */
#define _MPCP_SWRST_SWRST_SHIFT               0                                         /**< Shift value for MPCP_SWRST                  */
#define _MPCP_SWRST_SWRST_MASK                0x1UL                                     /**< Bit mask for MPCP_SWRST                     */
#define _MPCP_SWRST_SWRST_DEFAULT             0x00000000UL                              /**< Mode DEFAULT for MPCP_SWRST                 */
#define MPCP_SWRST_SWRST_DEFAULT              (_MPCP_SWRST_SWRST_DEFAULT << 0)          /**< Shifted mode DEFAULT for MPCP_SWRST         */
#define MPCP_SWRST_RESETTING                  (0x1UL << 1)                              /**< Software Reset Busy Status                  */
#define _MPCP_SWRST_RESETTING_SHIFT           1                                         /**< Shift value for MPCP_RESETTING              */
#define _MPCP_SWRST_RESETTING_MASK            0x2UL                                     /**< Bit mask for MPCP_RESETTING                 */
#define _MPCP_SWRST_RESETTING_DEFAULT         0x00000000UL                              /**< Mode DEFAULT for MPCP_SWRST                 */
#define MPCP_SWRST_RESETTING_DEFAULT          (_MPCP_SWRST_RESETTING_DEFAULT << 1)      /**< Shifted mode DEFAULT for MPCP_SWRST         */

/* Bit fields for MPCP CONNECT */
#define _MPCP_CONNECT_RESETVALUE              0x00000000UL                              /**< Default value for MPCP_CONNECT              */
#define _MPCP_CONNECT_MASK                    0x0000010FUL                              /**< Mask for MPCP_CONNECT                       */
#define _MPCP_CONNECT_IN_SHIFT                0                                         /**< Shift value for MPCP_IN                     */
#define _MPCP_CONNECT_IN_MASK                 0xFUL                                     /**< Bit mask for MPCP_IN                        */
#define _MPCP_CONNECT_IN_DEFAULT              0x00000000UL                              /**< Mode DEFAULT for MPCP_CONNECT               */
#define MPCP_CONNECT_IN_DEFAULT               (_MPCP_CONNECT_IN_DEFAULT << 0)           /**< Shifted mode DEFAULT for MPCP_CONNECT       */
#define MPCP_CONNECT_OUT                      (0x1UL << 8)                              /**< Output FIFO connect                         */
#define _MPCP_CONNECT_OUT_SHIFT               8                                         /**< Shift value for MPCP_OUT                    */
#define _MPCP_CONNECT_OUT_MASK                0x100UL                                   /**< Bit mask for MPCP_OUT                       */
#define _MPCP_CONNECT_OUT_DEFAULT             0x00000000UL                              /**< Mode DEFAULT for MPCP_CONNECT               */
#define MPCP_CONNECT_OUT_DEFAULT              (_MPCP_CONNECT_OUT_DEFAULT << 8)          /**< Shifted mode DEFAULT for MPCP_CONNECT       */

/* Bit fields for MPCP DISCLK */
#define _MPCP_DISCLK_RESETVALUE               0x00000002UL                              /**< Default value for MPCP_DISCLK               */
#define _MPCP_DISCLK_MASK                     0x00000003UL                              /**< Mask for MPCP_DISCLK                        */
#define _MPCP_DISCLK_DISCLK_SHIFT             0                                         /**< Shift value for MPCP_DISCLK                 */
#define _MPCP_DISCLK_DISCLK_MASK              0x3UL                                     /**< Bit mask for MPCP_DISCLK                    */
#define _MPCP_DISCLK_DISCLK_DEFAULT           0x00000002UL                              /**< Mode DEFAULT for MPCP_DISCLK                */
#define _MPCP_DISCLK_DISCLK_NONE              0x00000000UL                              /**< Mode NONE for MPCP_DISCLK                   */
#define _MPCP_DISCLK_DISCLK_ALL               0x00000001UL                              /**< Mode ALL for MPCP_DISCLK                    */
#define _MPCP_DISCLK_DISCLK_AUTO              0x00000002UL                              /**< Mode AUTO for MPCP_DISCLK                   */
#define _MPCP_DISCLK_DISCLK_NOTUSED           0x00000003UL                              /**< Mode NOTUSED for MPCP_DISCLK                */
#define MPCP_DISCLK_DISCLK_DEFAULT            (_MPCP_DISCLK_DISCLK_DEFAULT << 0)        /**< Shifted mode DEFAULT for MPCP_DISCLK        */
#define MPCP_DISCLK_DISCLK_NONE               (_MPCP_DISCLK_DISCLK_NONE << 0)           /**< Shifted mode NONE for MPCP_DISCLK           */
#define MPCP_DISCLK_DISCLK_ALL                (_MPCP_DISCLK_DISCLK_ALL << 0)            /**< Shifted mode ALL for MPCP_DISCLK            */
#define MPCP_DISCLK_DISCLK_AUTO               (_MPCP_DISCLK_DISCLK_AUTO << 0)           /**< Shifted mode AUTO for MPCP_DISCLK           */
#define MPCP_DISCLK_DISCLK_NOTUSED            (_MPCP_DISCLK_DISCLK_NOTUSED << 0)        /**< Shifted mode NOTUSED for MPCP_DISCLK        */

