SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_mpcp.h
/* Bit fields for MPCP FIFOIN */
#define _MPCP_FIFOIN_RESETVALUE               0x00000000UL                              /**< Default value for MPCP_FIFOIN               */
#define _MPCP_FIFOIN_MASK                     0x1FFF3F0FUL                              /**< Mask for MPCP_FIFOIN                        */
#define _MPCP_FIFOIN_FID_SHIFT                0                                         /**< Shift value for MPCP_FID                    */
#define _MPCP_FIFOIN_FID_MASK                 0xFUL                                     /**< Bit mask for MPCP_FID                       */
#define _MPCP_FIFOIN_FID_DEFAULT              0x00000000UL                              /**< Mode DEFAULT for MPCP_FIFOIN                */
#define MPCP_FIFOIN_FID_DEFAULT               (_MPCP_FIFOIN_FID_DEFAULT << 0)           /**< Shifted mode DEFAULT for MPCP_FIFOIN        */
#define _MPCP_FIFOIN_CID_SHIFT                8                                         /**< Shift value for MPCP_CID                    */
#define _MPCP_FIFOIN_CID_MASK                 0x3F00UL                                  /**< Bit mask for MPCP_CID                       */
#define _MPCP_FIFOIN_CID_DEFAULT              0x00000000UL                              /**< Mode DEFAULT for MPCP_FIFOIN                */
#define MPCP_FIFOIN_CID_DEFAULT               (_MPCP_FIFOIN_CID_DEFAULT << 8)           /**< Shifted mode DEFAULT for MPCP_FIFOIN        */
#define _MPCP_FIFOIN_REM_SHIFT                16                                        /**< Shift value for MPCP_REM                    */
#define _MPCP_FIFOIN_REM_MASK                 0xFF0000UL                                /**< Bit mask for MPCP_REM                       */
#define _MPCP_FIFOIN_REM_DEFAULT              0x00000000UL                              /**< Mode DEFAULT for MPCP_FIFOIN                */
#define MPCP_FIFOIN_REM_DEFAULT               (_MPCP_FIFOIN_REM_DEFAULT << 16)          /**< Shifted mode DEFAULT for MPCP_FIFOIN        */
#define _MPCP_FIFOIN_ALARM_SHIFT              24                                        /**< Shift value for MPCP_ALARM                  */
#define _MPCP_FIFOIN_ALARM_MASK               0x1F000000UL                              /**< Bit mask for MPCP_ALARM                     */
#define _MPCP_FIFOIN_ALARM_DEFAULT            0x00000000UL                              /**< Mode DEFAULT for MPCP_FIFOIN                */
#define MPCP_FIFOIN_ALARM_DEFAULT             (_MPCP_FIFOIN_ALARM_DEFAULT << 24)        /**< Shifted mode DEFAULT for MPCP_FIFOIN        */

/* Bit fields for MPCP FIFOOUT */
#define _MPCP_FIFOOUT_RESETVALUE              0x00000000UL                              /**< Default value for MPCP_FIFOOUT              */
#define _MPCP_FIFOOUT_MASK                    0x1FFF0000UL                              /**< Mask for MPCP_FIFOOUT                       */
#define _MPCP_FIFOOUT_CNT_SHIFT               16                                        /**< Shift value for MPCP_CNT                    */
#define _MPCP_FIFOOUT_CNT_MASK                0xFF0000UL                                /**< Bit mask for MPCP_CNT                       */
#define _MPCP_FIFOOUT_CNT_DEFAULT             0x00000000UL                              /**< Mode DEFAULT for MPCP_FIFOOUT               */
#define MPCP_FIFOOUT_CNT_DEFAULT              (_MPCP_FIFOOUT_CNT_DEFAULT << 16)         /**< Shifted mode DEFAULT for MPCP_FIFOOUT       */
#define _MPCP_FIFOOUT_ALARM_SHIFT             24                                        /**< Shift value for MPCP_ALARM                  */
#define _MPCP_FIFOOUT_ALARM_MASK              0x1F000000UL                              /**< Bit mask for MPCP_ALARM                     */
#define _MPCP_FIFOOUT_ALARM_DEFAULT           0x00000000UL                              /**< Mode DEFAULT for MPCP_FIFOOUT               */
#define MPCP_FIFOOUT_ALARM_DEFAULT            (_MPCP_FIFOOUT_ALARM_DEFAULT << 24)       /**< Shifted mode DEFAULT for MPCP_FIFOOUT       */

/* Bit fields for MPCP FMTOUT */
#define _MPCP_FMTOUT_RESETVALUE               0x0000000FUL                              /**< Default value for MPCP_FMTOUT               */
#define _MPCP_FMTOUT_MASK                     0x0303031FUL                              /**< Mask for MPCP_FMTOUT                        */
#define _MPCP_FMTOUT_ELEMSIZE_SHIFT           0                                         /**< Shift value for MPCP_ELEMSIZE               */
#define _MPCP_FMTOUT_ELEMSIZE_MASK            0x1FUL                                    /**< Bit mask for MPCP_ELEMSIZE                  */
#define _MPCP_FMTOUT_ELEMSIZE_DEFAULT         0x0000000FUL                              /**< Mode DEFAULT for MPCP_FMTOUT                */
#define MPCP_FMTOUT_ELEMSIZE_DEFAULT          (_MPCP_FMTOUT_ELEMSIZE_DEFAULT << 0)      /**< Shifted mode DEFAULT for MPCP_FMTOUT        */
#define _MPCP_FMTOUT_ELEMNB_SHIFT             8                                         /**< Shift value for MPCP_ELEMNB                 */
#define _MPCP_FMTOUT_ELEMNB_MASK              0x300UL                                   /**< Bit mask for MPCP_ELEMNB                    */
#define _MPCP_FMTOUT_ELEMNB_DEFAULT           0x00000000UL                              /**< Mode DEFAULT for MPCP_FMTOUT                */
#define _MPCP_FMTOUT_ELEMNB_ONE               0x00000000UL                              /**< Mode ONE for MPCP_FMTOUT                    */
#define _MPCP_FMTOUT_ELEMNB_TWO               0x00000001UL                              /**< Mode TWO for MPCP_FMTOUT                    */
#define _MPCP_FMTOUT_ELEMNB_FOUR              0x00000002UL                              /**< Mode FOUR for MPCP_FMTOUT                   */
#define MPCP_FMTOUT_ELEMNB_DEFAULT            (_MPCP_FMTOUT_ELEMNB_DEFAULT << 8)        /**< Shifted mode DEFAULT for MPCP_FMTOUT        */
#define MPCP_FMTOUT_ELEMNB_ONE                (_MPCP_FMTOUT_ELEMNB_ONE << 8)            /**< Shifted mode ONE for MPCP_FMTOUT            */
#define MPCP_FMTOUT_ELEMNB_TWO                (_MPCP_FMTOUT_ELEMNB_TWO << 8)            /**< Shifted mode TWO for MPCP_FMTOUT            */
#define MPCP_FMTOUT_ELEMNB_FOUR               (_MPCP_FMTOUT_ELEMNB_FOUR << 8)           /**< Shifted mode FOUR for MPCP_FMTOUT           */
#define _MPCP_FMTOUT_ELEMALIGN_SHIFT          16                                        /**< Shift value for MPCP_ELEMALIGN              */
#define _MPCP_FMTOUT_ELEMALIGN_MASK           0x30000UL                                 /**< Bit mask for MPCP_ELEMALIGN                 */
#define _MPCP_FMTOUT_ELEMALIGN_DEFAULT        0x00000000UL                              /**< Mode DEFAULT for MPCP_FMTOUT                */
#define _MPCP_FMTOUT_ELEMALIGN_WORD           0x00000000UL                              /**< Mode WORD for MPCP_FMTOUT                   */
#define _MPCP_FMTOUT_ELEMALIGN_HALFWORD       0x00000001UL                              /**< Mode HALFWORD for MPCP_FMTOUT               */
#define _MPCP_FMTOUT_ELEMALIGN_BYTE           0x00000002UL                              /**< Mode BYTE for MPCP_FMTOUT                   */
#define MPCP_FMTOUT_ELEMALIGN_DEFAULT         (_MPCP_FMTOUT_ELEMALIGN_DEFAULT << 16)    /**< Shifted mode DEFAULT for MPCP_FMTOUT        */
#define MPCP_FMTOUT_ELEMALIGN_WORD            (_MPCP_FMTOUT_ELEMALIGN_WORD << 16)       /**< Shifted mode WORD for MPCP_FMTOUT           */
#define MPCP_FMTOUT_ELEMALIGN_HALFWORD        (_MPCP_FMTOUT_ELEMALIGN_HALFWORD << 16)   /**< Shifted mode HALFWORD for MPCP_FMTOUT       */
#define MPCP_FMTOUT_ELEMALIGN_BYTE            (_MPCP_FMTOUT_ELEMALIGN_BYTE << 16)       /**< Shifted mode BYTE for MPCP_FMTOUT           */
#define _MPCP_FMTOUT_ELEMTYPE_SHIFT           24                                        /**< Shift value for MPCP_ELEMTYPE               */
#define _MPCP_FMTOUT_ELEMTYPE_MASK            0x3000000UL                               /**< Bit mask for MPCP_ELEMTYPE                  */
#define _MPCP_FMTOUT_ELEMTYPE_DEFAULT         0x00000000UL                              /**< Mode DEFAULT for MPCP_FMTOUT                */
#define _MPCP_FMTOUT_ELEMTYPE_COMPLEX         0x00000000UL                              /**< Mode COMPLEX for MPCP_FMTOUT                */
#define _MPCP_FMTOUT_ELEMTYPE_INTEGER         0x00000001UL                              /**< Mode INTEGER for MPCP_FMTOUT                */
#define _MPCP_FMTOUT_ELEMTYPE_LOGIC           0x00000002UL                              /**< Mode LOGIC for MPCP_FMTOUT                  */
#define MPCP_FMTOUT_ELEMTYPE_DEFAULT          (_MPCP_FMTOUT_ELEMTYPE_DEFAULT << 24)     /**< Shifted mode DEFAULT for MPCP_FMTOUT        */
#define MPCP_FMTOUT_ELEMTYPE_COMPLEX          (_MPCP_FMTOUT_ELEMTYPE_COMPLEX << 24)     /**< Shifted mode COMPLEX for MPCP_FMTOUT        */
#define MPCP_FMTOUT_ELEMTYPE_INTEGER          (_MPCP_FMTOUT_ELEMTYPE_INTEGER << 24)     /**< Shifted mode INTEGER for MPCP_FMTOUT        */
#define MPCP_FMTOUT_ELEMTYPE_LOGIC            (_MPCP_FMTOUT_ELEMTYPE_LOGIC << 24)       /**< Shifted mode LOGIC for MPCP_FMTOUT          */

