SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_mpcp.h
/* Bit fields for MPCP CTRL1 */
#define _MPCP_CTRL1_RESETVALUE                0x00000000UL                              /**< Default value for MPCP_CTRL1                */
#define _MPCP_CTRL1_MASK                      0xFFFFFFFFUL                              /**< Mask for MPCP_CTRL1                         */
#define MPCP_CTRL1_RST                        (0x1UL << 0)                              /**< New BitField                                */
#define _MPCP_CTRL1_RST_SHIFT                 0                                         /**< Shift value for MPCP_RST                    */
#define _MPCP_CTRL1_RST_MASK                  0x1UL                                     /**< Bit mask for MPCP_RST                       */
#define _MPCP_CTRL1_RST_DEFAULT               0x00000000UL                              /**< Mode DEFAULT for MPCP_CTRL1                 */
#define MPCP_CTRL1_RST_DEFAULT                (_MPCP_CTRL1_RST_DEFAULT << 0)            /**< Shifted mode DEFAULT for MPCP_CTRL1         */
#define MPCP_CTRL1_START                      (0x1UL << 1)                              /**< New BitField                                */
#define _MPCP_CTRL1_START_SHIFT               1                                         /**< Shift value for MPCP_START                  */
#define _MPCP_CTRL1_START_MASK                0x2UL                                     /**< Bit mask for MPCP_START                     */
#define _MPCP_CTRL1_START_DEFAULT             0x00000000UL                              /**< Mode DEFAULT for MPCP_CTRL1                 */
#define _MPCP_CTRL1_START_Stop                0x00000000UL                              /**< Mode Stop for MPCP_CTRL1                    */
#define _MPCP_CTRL1_START_Start               0x00000001UL                              /**< Mode Start for MPCP_CTRL1                   */
#define MPCP_CTRL1_START_DEFAULT              (_MPCP_CTRL1_START_DEFAULT << 1)          /**< Shifted mode DEFAULT for MPCP_CTRL1         */
#define MPCP_CTRL1_START_Stop                 (_MPCP_CTRL1_START_Stop << 1)             /**< Shifted mode Stop for MPCP_CTRL1            */
#define MPCP_CTRL1_START_Start                (_MPCP_CTRL1_START_Start << 1)            /**< Shifted mode Start for MPCP_CTRL1           */
#define MPCP_CTRL1_DISRST                     (0x1UL << 2)                              /**< New BitField                                */
#define _MPCP_CTRL1_DISRST_SHIFT              2                                         /**< Shift value for MPCP_DISRST                 */
#define _MPCP_CTRL1_DISRST_MASK               0x4UL                                     /**< Bit mask for MPCP_DISRST                    */
#define _MPCP_CTRL1_DISRST_DEFAULT            0x00000000UL                              /**< Mode DEFAULT for MPCP_CTRL1                 */
#define _MPCP_CTRL1_DISRST_NO                 0x00000000UL                              /**< Mode NO for MPCP_CTRL1                      */
#define _MPCP_CTRL1_DISRST_YES                0x00000001UL                              /**< Mode YES for MPCP_CTRL1                     */
#define MPCP_CTRL1_DISRST_DEFAULT             (_MPCP_CTRL1_DISRST_DEFAULT << 2)         /**< Shifted mode DEFAULT for MPCP_CTRL1         */
#define MPCP_CTRL1_DISRST_NO                  (_MPCP_CTRL1_DISRST_NO << 2)              /**< Shifted mode NO for MPCP_CTRL1              */
#define MPCP_CTRL1_DISRST_YES                 (_MPCP_CTRL1_DISRST_YES << 2)             /**< Shifted mode YES for MPCP_CTRL1             */
#define MPCP_CTRL1_ENREQOUT                   (0x1UL << 3)                              /**< New BitField                                */
#define _MPCP_CTRL1_ENREQOUT_SHIFT            3                                         /**< Shift value for MPCP_ENREQOUT               */
#define _MPCP_CTRL1_ENREQOUT_MASK             0x8UL                                     /**< Bit mask for MPCP_ENREQOUT                  */
#define _MPCP_CTRL1_ENREQOUT_DEFAULT          0x00000000UL                              /**< Mode DEFAULT for MPCP_CTRL1                 */
#define _MPCP_CTRL1_ENREQOUT_NO               0x00000000UL                              /**< Mode NO for MPCP_CTRL1                      */
#define _MPCP_CTRL1_ENREQOUT_YES              0x00000001UL                              /**< Mode YES for MPCP_CTRL1                     */
#define MPCP_CTRL1_ENREQOUT_DEFAULT           (_MPCP_CTRL1_ENREQOUT_DEFAULT << 3)       /**< Shifted mode DEFAULT for MPCP_CTRL1         */
#define MPCP_CTRL1_ENREQOUT_NO                (_MPCP_CTRL1_ENREQOUT_NO << 3)            /**< Shifted mode NO for MPCP_CTRL1              */
#define MPCP_CTRL1_ENREQOUT_YES               (_MPCP_CTRL1_ENREQOUT_YES << 3)           /**< Shifted mode YES for MPCP_CTRL1             */
#define MPCP_CTRL1_FORMATIN                   (0x1UL << 4)                              /**< New BitField                                */
#define _MPCP_CTRL1_FORMATIN_SHIFT            4                                         /**< Shift value for MPCP_FORMATIN               */
#define _MPCP_CTRL1_FORMATIN_MASK             0x10UL                                    /**< Bit mask for MPCP_FORMATIN                  */
#define _MPCP_CTRL1_FORMATIN_DEFAULT          0x00000000UL                              /**< Mode DEFAULT for MPCP_CTRL1                 */
#define _MPCP_CTRL1_FORMATIN_Long             0x00000000UL                              /**< Mode Long for MPCP_CTRL1                    */
#define _MPCP_CTRL1_FORMATIN_Short            0x00000001UL                              /**< Mode Short for MPCP_CTRL1                   */
#define MPCP_CTRL1_FORMATIN_DEFAULT           (_MPCP_CTRL1_FORMATIN_DEFAULT << 4)       /**< Shifted mode DEFAULT for MPCP_CTRL1         */
#define MPCP_CTRL1_FORMATIN_Long              (_MPCP_CTRL1_FORMATIN_Long << 4)          /**< Shifted mode Long for MPCP_CTRL1            */
#define MPCP_CTRL1_FORMATIN_Short             (_MPCP_CTRL1_FORMATIN_Short << 4)         /**< Shifted mode Short for MPCP_CTRL1           */
#define MPCP_CTRL1_WHITENING                  (0x1UL << 5)                              /**< New BitField                                */
#define _MPCP_CTRL1_WHITENING_SHIFT           5                                         /**< Shift value for MPCP_WHITENING              */
#define _MPCP_CTRL1_WHITENING_MASK            0x20UL                                    /**< Bit mask for MPCP_WHITENING                 */
#define _MPCP_CTRL1_WHITENING_DEFAULT         0x00000000UL                              /**< Mode DEFAULT for MPCP_CTRL1                 */
#define _MPCP_CTRL1_WHITENING_Disable         0x00000000UL                              /**< Mode Disable for MPCP_CTRL1                 */
#define _MPCP_CTRL1_WHITENING_Enable          0x00000001UL                              /**< Mode Enable for MPCP_CTRL1                  */
#define MPCP_CTRL1_WHITENING_DEFAULT          (_MPCP_CTRL1_WHITENING_DEFAULT << 5)      /**< Shifted mode DEFAULT for MPCP_CTRL1         */
#define MPCP_CTRL1_WHITENING_Disable          (_MPCP_CTRL1_WHITENING_Disable << 5)      /**< Shifted mode Disable for MPCP_CTRL1         */
#define MPCP_CTRL1_WHITENING_Enable           (_MPCP_CTRL1_WHITENING_Enable << 5)       /**< Shifted mode Enable for MPCP_CTRL1          */
#define MPCP_CTRL1_USECOSSIN                  (0x1UL << 6)                              /**< New BitField                                */
#define _MPCP_CTRL1_USECOSSIN_SHIFT           6                                         /**< Shift value for MPCP_USECOSSIN              */
#define _MPCP_CTRL1_USECOSSIN_MASK            0x40UL                                    /**< Bit mask for MPCP_USECOSSIN                 */
#define _MPCP_CTRL1_USECOSSIN_DEFAULT         0x00000000UL                              /**< Mode DEFAULT for MPCP_CTRL1                 */
#define _MPCP_CTRL1_USECOSSIN_NO              0x00000000UL                              /**< Mode NO for MPCP_CTRL1                      */
#define _MPCP_CTRL1_USECOSSIN_YES             0x00000001UL                              /**< Mode YES for MPCP_CTRL1                     */
#define MPCP_CTRL1_USECOSSIN_DEFAULT          (_MPCP_CTRL1_USECOSSIN_DEFAULT << 6)      /**< Shifted mode DEFAULT for MPCP_CTRL1         */
#define MPCP_CTRL1_USECOSSIN_NO               (_MPCP_CTRL1_USECOSSIN_NO << 6)           /**< Shifted mode NO for MPCP_CTRL1              */
#define MPCP_CTRL1_USECOSSIN_YES              (_MPCP_CTRL1_USECOSSIN_YES << 6)          /**< Shifted mode YES for MPCP_CTRL1             */
#define MPCP_CTRL1_DECIMATE                   (0x1UL << 7)                              /**< New BitField                                */
#define _MPCP_CTRL1_DECIMATE_SHIFT            7                                         /**< Shift value for MPCP_DECIMATE               */
#define _MPCP_CTRL1_DECIMATE_MASK             0x80UL                                    /**< Bit mask for MPCP_DECIMATE                  */
#define _MPCP_CTRL1_DECIMATE_DEFAULT          0x00000000UL                              /**< Mode DEFAULT for MPCP_CTRL1                 */
#define _MPCP_CTRL1_DECIMATE_Disable          0x00000000UL                              /**< Mode Disable for MPCP_CTRL1                 */
#define _MPCP_CTRL1_DECIMATE_Enable           0x00000001UL                              /**< Mode Enable for MPCP_CTRL1                  */
#define MPCP_CTRL1_DECIMATE_DEFAULT           (_MPCP_CTRL1_DECIMATE_DEFAULT << 7)       /**< Shifted mode DEFAULT for MPCP_CTRL1         */
#define MPCP_CTRL1_DECIMATE_Disable           (_MPCP_CTRL1_DECIMATE_Disable << 7)       /**< Shifted mode Disable for MPCP_CTRL1         */
#define MPCP_CTRL1_DECIMATE_Enable            (_MPCP_CTRL1_DECIMATE_Enable << 7)        /**< Shifted mode Enable for MPCP_CTRL1          */
#define MPCP_CTRL1_DEROTDSSS                  (0x1UL << 8)                              /**< New BitField                                */
#define _MPCP_CTRL1_DEROTDSSS_SHIFT           8                                         /**< Shift value for MPCP_DEROTDSSS              */
#define _MPCP_CTRL1_DEROTDSSS_MASK            0x100UL                                   /**< Bit mask for MPCP_DEROTDSSS                 */
#define _MPCP_CTRL1_DEROTDSSS_DEFAULT         0x00000000UL                              /**< Mode DEFAULT for MPCP_CTRL1                 */
#define _MPCP_CTRL1_DEROTDSSS_NO              0x00000000UL                              /**< Mode NO for MPCP_CTRL1                      */
#define _MPCP_CTRL1_DEROTDSSS_YES             0x00000001UL                              /**< Mode YES for MPCP_CTRL1                     */
#define MPCP_CTRL1_DEROTDSSS_DEFAULT          (_MPCP_CTRL1_DEROTDSSS_DEFAULT << 8)      /**< Shifted mode DEFAULT for MPCP_CTRL1         */
#define MPCP_CTRL1_DEROTDSSS_NO               (_MPCP_CTRL1_DEROTDSSS_NO << 8)           /**< Shifted mode NO for MPCP_CTRL1              */
#define MPCP_CTRL1_DEROTDSSS_YES              (_MPCP_CTRL1_DEROTDSSS_YES << 8)          /**< Shifted mode YES for MPCP_CTRL1             */
#define MPCP_CTRL1_PRBSMOD                    (0x1UL << 9)                              /**< New BitField                                */
#define _MPCP_CTRL1_PRBSMOD_SHIFT             9                                         /**< Shift value for MPCP_PRBSMOD                */
#define _MPCP_CTRL1_PRBSMOD_MASK              0x200UL                                   /**< Bit mask for MPCP_PRBSMOD                   */
#define _MPCP_CTRL1_PRBSMOD_DEFAULT           0x00000000UL                              /**< Mode DEFAULT for MPCP_CTRL1                 */
#define _MPCP_CTRL1_PRBSMOD_NO                0x00000000UL                              /**< Mode NO for MPCP_CTRL1                      */
#define _MPCP_CTRL1_PRBSMOD_YES               0x00000001UL                              /**< Mode YES for MPCP_CTRL1                     */
#define MPCP_CTRL1_PRBSMOD_DEFAULT            (_MPCP_CTRL1_PRBSMOD_DEFAULT << 9)        /**< Shifted mode DEFAULT for MPCP_CTRL1         */
#define MPCP_CTRL1_PRBSMOD_NO                 (_MPCP_CTRL1_PRBSMOD_NO << 9)             /**< Shifted mode NO for MPCP_CTRL1              */
#define MPCP_CTRL1_PRBSMOD_YES                (_MPCP_CTRL1_PRBSMOD_YES << 9)            /**< Shifted mode YES for MPCP_CTRL1             */
#define MPCP_CTRL1_SWAPIQOUT                  (0x1UL << 10)                             /**< New BitField                                */
#define _MPCP_CTRL1_SWAPIQOUT_SHIFT           10                                        /**< Shift value for MPCP_SWAPIQOUT              */
#define _MPCP_CTRL1_SWAPIQOUT_MASK            0x400UL                                   /**< Bit mask for MPCP_SWAPIQOUT                 */
#define _MPCP_CTRL1_SWAPIQOUT_DEFAULT         0x00000000UL                              /**< Mode DEFAULT for MPCP_CTRL1                 */
#define _MPCP_CTRL1_SWAPIQOUT_No              0x00000000UL                              /**< Mode No for MPCP_CTRL1                      */
#define _MPCP_CTRL1_SWAPIQOUT_Yes             0x00000001UL                              /**< Mode Yes for MPCP_CTRL1                     */
#define MPCP_CTRL1_SWAPIQOUT_DEFAULT          (_MPCP_CTRL1_SWAPIQOUT_DEFAULT << 10)     /**< Shifted mode DEFAULT for MPCP_CTRL1         */
#define MPCP_CTRL1_SWAPIQOUT_No               (_MPCP_CTRL1_SWAPIQOUT_No << 10)          /**< Shifted mode No for MPCP_CTRL1              */
#define MPCP_CTRL1_SWAPIQOUT_Yes              (_MPCP_CTRL1_SWAPIQOUT_Yes << 10)         /**< Shifted mode Yes for MPCP_CTRL1             */
#define MPCP_CTRL1_SYNCSTAT                   (0x1UL << 11)                             /**< New BitField                                */
#define _MPCP_CTRL1_SYNCSTAT_SHIFT            11                                        /**< Shift value for MPCP_SYNCSTAT               */
#define _MPCP_CTRL1_SYNCSTAT_MASK             0x800UL                                   /**< Bit mask for MPCP_SYNCSTAT                  */
#define _MPCP_CTRL1_SYNCSTAT_DEFAULT          0x00000000UL                              /**< Mode DEFAULT for MPCP_CTRL1                 */
#define _MPCP_CTRL1_SYNCSTAT_NO               0x00000000UL                              /**< Mode NO for MPCP_CTRL1                      */
#define _MPCP_CTRL1_SYNCSTAT_YES              0x00000001UL                              /**< Mode YES for MPCP_CTRL1                     */
#define MPCP_CTRL1_SYNCSTAT_DEFAULT           (_MPCP_CTRL1_SYNCSTAT_DEFAULT << 11)      /**< Shifted mode DEFAULT for MPCP_CTRL1         */
#define MPCP_CTRL1_SYNCSTAT_NO                (_MPCP_CTRL1_SYNCSTAT_NO << 11)           /**< Shifted mode NO for MPCP_CTRL1              */
#define MPCP_CTRL1_SYNCSTAT_YES               (_MPCP_CTRL1_SYNCSTAT_YES << 11)          /**< Shifted mode YES for MPCP_CTRL1             */
#define _MPCP_CTRL1_OP1_SHIFT                 12                                        /**< Shift value for MPCP_OP1                    */
#define _MPCP_CTRL1_OP1_MASK                  0xF000UL                                  /**< Bit mask for MPCP_OP1                       */
#define _MPCP_CTRL1_OP1_DEFAULT               0x00000000UL                              /**< Mode DEFAULT for MPCP_CTRL1                 */
#define _MPCP_CTRL1_OP1_A                     0x00000000UL                              /**< Mode A for MPCP_CTRL1                       */
#define _MPCP_CTRL1_OP1_B                     0x00000001UL                              /**< Mode B for MPCP_CTRL1                       */
#define _MPCP_CTRL1_OP1_minusA                0x00000002UL                              /**< Mode minusA for MPCP_CTRL1                  */
#define _MPCP_CTRL1_OP1_minusB                0x00000003UL                              /**< Mode minusB for MPCP_CTRL1                  */
#define _MPCP_CTRL1_OP1_AplusB                0x00000004UL                              /**< Mode AplusB for MPCP_CTRL1                  */
#define _MPCP_CTRL1_OP1_AminusB               0x00000005UL                              /**< Mode AminusB for MPCP_CTRL1                 */
#define _MPCP_CTRL1_OP1_AmulB                 0x00000006UL                              /**< Mode AmulB for MPCP_CTRL1                   */
#define _MPCP_CTRL1_OP1_AmulConjB             0x00000007UL                              /**< Mode AmulConjB for MPCP_CTRL1               */
#define _MPCP_CTRL1_OP1_AmulConjA             0x00000009UL                              /**< Mode AmulConjA for MPCP_CTRL1               */
#define _MPCP_CTRL1_OP1_BmulConjB             0x0000000AUL                              /**< Mode BmulConjB for MPCP_CTRL1               */
#define _MPCP_CTRL1_OP1_AxorB                 0x0000000BUL                              /**< Mode AxorB for MPCP_CTRL1                   */
#define _MPCP_CTRL1_OP1_SquareRoot            0x0000000CUL                              /**< Mode SquareRoot for MPCP_CTRL1              */
#define MPCP_CTRL1_OP1_DEFAULT                (_MPCP_CTRL1_OP1_DEFAULT << 12)           /**< Shifted mode DEFAULT for MPCP_CTRL1         */
#define MPCP_CTRL1_OP1_A                      (_MPCP_CTRL1_OP1_A << 12)                 /**< Shifted mode A for MPCP_CTRL1               */
#define MPCP_CTRL1_OP1_B                      (_MPCP_CTRL1_OP1_B << 12)                 /**< Shifted mode B for MPCP_CTRL1               */
#define MPCP_CTRL1_OP1_minusA                 (_MPCP_CTRL1_OP1_minusA << 12)            /**< Shifted mode minusA for MPCP_CTRL1          */
#define MPCP_CTRL1_OP1_minusB                 (_MPCP_CTRL1_OP1_minusB << 12)            /**< Shifted mode minusB for MPCP_CTRL1          */
#define MPCP_CTRL1_OP1_AplusB                 (_MPCP_CTRL1_OP1_AplusB << 12)            /**< Shifted mode AplusB for MPCP_CTRL1          */
#define MPCP_CTRL1_OP1_AminusB                (_MPCP_CTRL1_OP1_AminusB << 12)           /**< Shifted mode AminusB for MPCP_CTRL1         */
#define MPCP_CTRL1_OP1_AmulB                  (_MPCP_CTRL1_OP1_AmulB << 12)             /**< Shifted mode AmulB for MPCP_CTRL1           */
#define MPCP_CTRL1_OP1_AmulConjB              (_MPCP_CTRL1_OP1_AmulConjB << 12)         /**< Shifted mode AmulConjB for MPCP_CTRL1       */
#define MPCP_CTRL1_OP1_AmulConjA              (_MPCP_CTRL1_OP1_AmulConjA << 12)         /**< Shifted mode AmulConjA for MPCP_CTRL1       */
#define MPCP_CTRL1_OP1_BmulConjB              (_MPCP_CTRL1_OP1_BmulConjB << 12)         /**< Shifted mode BmulConjB for MPCP_CTRL1       */
#define MPCP_CTRL1_OP1_AxorB                  (_MPCP_CTRL1_OP1_AxorB << 12)             /**< Shifted mode AxorB for MPCP_CTRL1           */
#define MPCP_CTRL1_OP1_SquareRoot             (_MPCP_CTRL1_OP1_SquareRoot << 12)        /**< Shifted mode SquareRoot for MPCP_CTRL1      */
#define _MPCP_CTRL1_OP2_SHIFT                 16                                        /**< Shift value for MPCP_OP2                    */
#define _MPCP_CTRL1_OP2_MASK                  0xF0000UL                                 /**< Bit mask for MPCP_OP2                       */
#define _MPCP_CTRL1_OP2_DEFAULT               0x00000000UL                              /**< Mode DEFAULT for MPCP_CTRL1                 */
#define _MPCP_CTRL1_OP2_A                     0x00000000UL                              /**< Mode A for MPCP_CTRL1                       */
#define _MPCP_CTRL1_OP2_B                     0x00000001UL                              /**< Mode B for MPCP_CTRL1                       */
#define _MPCP_CTRL1_OP2_minusA                0x00000002UL                              /**< Mode minusA for MPCP_CTRL1                  */
#define _MPCP_CTRL1_OP2_minusB                0x00000003UL                              /**< Mode minusB for MPCP_CTRL1                  */
#define _MPCP_CTRL1_OP2_AplusB                0x00000004UL                              /**< Mode AplusB for MPCP_CTRL1                  */
#define _MPCP_CTRL1_OP2_AminusB               0x00000005UL                              /**< Mode AminusB for MPCP_CTRL1                 */
#define _MPCP_CTRL1_OP2_AmulB                 0x00000006UL                              /**< Mode AmulB for MPCP_CTRL1                   */
#define _MPCP_CTRL1_OP2_AmulConjB             0x00000007UL                              /**< Mode AmulConjB for MPCP_CTRL1               */
#define _MPCP_CTRL1_OP2_AdivB                 0x00000008UL                              /**< Mode AdivB for MPCP_CTRL1                   */
#define _MPCP_CTRL1_OP2_AmulConjA             0x00000009UL                              /**< Mode AmulConjA for MPCP_CTRL1               */
#define _MPCP_CTRL1_OP2_BmulConjB             0x0000000AUL                              /**< Mode BmulConjB for MPCP_CTRL1               */
#define _MPCP_CTRL1_OP2_AxorB                 0x0000000BUL                              /**< Mode AxorB for MPCP_CTRL1                   */
#define MPCP_CTRL1_OP2_DEFAULT                (_MPCP_CTRL1_OP2_DEFAULT << 16)           /**< Shifted mode DEFAULT for MPCP_CTRL1         */
#define MPCP_CTRL1_OP2_A                      (_MPCP_CTRL1_OP2_A << 16)                 /**< Shifted mode A for MPCP_CTRL1               */
#define MPCP_CTRL1_OP2_B                      (_MPCP_CTRL1_OP2_B << 16)                 /**< Shifted mode B for MPCP_CTRL1               */
#define MPCP_CTRL1_OP2_minusA                 (_MPCP_CTRL1_OP2_minusA << 16)            /**< Shifted mode minusA for MPCP_CTRL1          */
#define MPCP_CTRL1_OP2_minusB                 (_MPCP_CTRL1_OP2_minusB << 16)            /**< Shifted mode minusB for MPCP_CTRL1          */
#define MPCP_CTRL1_OP2_AplusB                 (_MPCP_CTRL1_OP2_AplusB << 16)            /**< Shifted mode AplusB for MPCP_CTRL1          */
#define MPCP_CTRL1_OP2_AminusB                (_MPCP_CTRL1_OP2_AminusB << 16)           /**< Shifted mode AminusB for MPCP_CTRL1         */
#define MPCP_CTRL1_OP2_AmulB                  (_MPCP_CTRL1_OP2_AmulB << 16)             /**< Shifted mode AmulB for MPCP_CTRL1           */
#define MPCP_CTRL1_OP2_AmulConjB              (_MPCP_CTRL1_OP2_AmulConjB << 16)         /**< Shifted mode AmulConjB for MPCP_CTRL1       */
#define MPCP_CTRL1_OP2_AdivB                  (_MPCP_CTRL1_OP2_AdivB << 16)             /**< Shifted mode AdivB for MPCP_CTRL1           */
#define MPCP_CTRL1_OP2_AmulConjA              (_MPCP_CTRL1_OP2_AmulConjA << 16)         /**< Shifted mode AmulConjA for MPCP_CTRL1       */
#define MPCP_CTRL1_OP2_BmulConjB              (_MPCP_CTRL1_OP2_BmulConjB << 16)         /**< Shifted mode BmulConjB for MPCP_CTRL1       */
#define MPCP_CTRL1_OP2_AxorB                  (_MPCP_CTRL1_OP2_AxorB << 16)             /**< Shifted mode AxorB for MPCP_CTRL1           */
#define _MPCP_CTRL1_SHIFT0_SHIFT              20                                        /**< Shift value for MPCP_SHIFT0                 */
#define _MPCP_CTRL1_SHIFT0_MASK               0x3F00000UL                               /**< Bit mask for MPCP_SHIFT0                    */
#define _MPCP_CTRL1_SHIFT0_DEFAULT            0x00000000UL                              /**< Mode DEFAULT for MPCP_CTRL1                 */
#define MPCP_CTRL1_SHIFT0_DEFAULT             (_MPCP_CTRL1_SHIFT0_DEFAULT << 20)        /**< Shifted mode DEFAULT for MPCP_CTRL1         */
#define _MPCP_CTRL1_SHIFT1_SHIFT              26                                        /**< Shift value for MPCP_SHIFT1                 */
#define _MPCP_CTRL1_SHIFT1_MASK               0xFC000000UL                              /**< Bit mask for MPCP_SHIFT1                    */
#define _MPCP_CTRL1_SHIFT1_DEFAULT            0x00000000UL                              /**< Mode DEFAULT for MPCP_CTRL1                 */
#define MPCP_CTRL1_SHIFT1_DEFAULT             (_MPCP_CTRL1_SHIFT1_DEFAULT << 26)        /**< Shifted mode DEFAULT for MPCP_CTRL1         */

