SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_mpcp.h
/* Bit fields for MPCP CTRL2 */
#define _MPCP_CTRL2_RESETVALUE                0x00000000UL                              /**< Default value for MPCP_CTRL2                */
#define _MPCP_CTRL2_MASK                      0xFFFFFFFFUL                              /**< Mask for MPCP_CTRL2                         */
#define MPCP_CTRL2_GENIT                      (0x1UL << 0)                              /**< New BitField                                */
#define _MPCP_CTRL2_GENIT_SHIFT               0                                         /**< Shift value for MPCP_GENIT                  */
#define _MPCP_CTRL2_GENIT_MASK                0x1UL                                     /**< Bit mask for MPCP_GENIT                     */
#define _MPCP_CTRL2_GENIT_DEFAULT             0x00000000UL                              /**< Mode DEFAULT for MPCP_CTRL2                 */
#define _MPCP_CTRL2_GENIT_NO                  0x00000000UL                              /**< Mode NO for MPCP_CTRL2                      */
#define _MPCP_CTRL2_GENIT_YES                 0x00000001UL                              /**< Mode YES for MPCP_CTRL2                     */
#define MPCP_CTRL2_GENIT_DEFAULT              (_MPCP_CTRL2_GENIT_DEFAULT << 0)          /**< Shifted mode DEFAULT for MPCP_CTRL2         */
#define MPCP_CTRL2_GENIT_NO                   (_MPCP_CTRL2_GENIT_NO << 0)               /**< Shifted mode NO for MPCP_CTRL2              */
#define MPCP_CTRL2_GENIT_YES                  (_MPCP_CTRL2_GENIT_YES << 0)              /**< Shifted mode YES for MPCP_CTRL2             */
#define MPCP_CTRL2_LOOPBACK                   (0x1UL << 1)                              /**< New BitField                                */
#define _MPCP_CTRL2_LOOPBACK_SHIFT            1                                         /**< Shift value for MPCP_LOOPBACK               */
#define _MPCP_CTRL2_LOOPBACK_MASK             0x2UL                                     /**< Bit mask for MPCP_LOOPBACK                  */
#define _MPCP_CTRL2_LOOPBACK_DEFAULT          0x00000000UL                              /**< Mode DEFAULT for MPCP_CTRL2                 */
#define _MPCP_CTRL2_LOOPBACK_Disable          0x00000000UL                              /**< Mode Disable for MPCP_CTRL2                 */
#define _MPCP_CTRL2_LOOPBACK_Enable           0x00000001UL                              /**< Mode Enable for MPCP_CTRL2                  */
#define MPCP_CTRL2_LOOPBACK_DEFAULT           (_MPCP_CTRL2_LOOPBACK_DEFAULT << 1)       /**< Shifted mode DEFAULT for MPCP_CTRL2         */
#define MPCP_CTRL2_LOOPBACK_Disable           (_MPCP_CTRL2_LOOPBACK_Disable << 1)       /**< Shifted mode Disable for MPCP_CTRL2         */
#define MPCP_CTRL2_LOOPBACK_Enable            (_MPCP_CTRL2_LOOPBACK_Enable << 1)        /**< Shifted mode Enable for MPCP_CTRL2          */
#define MPCP_CTRL2_USECTEA                    (0x1UL << 2)                              /**< New BitField                                */
#define _MPCP_CTRL2_USECTEA_SHIFT             2                                         /**< Shift value for MPCP_USECTEA                */
#define _MPCP_CTRL2_USECTEA_MASK              0x4UL                                     /**< Bit mask for MPCP_USECTEA                   */
#define _MPCP_CTRL2_USECTEA_DEFAULT           0x00000000UL                              /**< Mode DEFAULT for MPCP_CTRL2                 */
#define _MPCP_CTRL2_USECTEA_NO                0x00000000UL                              /**< Mode NO for MPCP_CTRL2                      */
#define _MPCP_CTRL2_USECTEA_YES               0x00000001UL                              /**< Mode YES for MPCP_CTRL2                     */
#define MPCP_CTRL2_USECTEA_DEFAULT            (_MPCP_CTRL2_USECTEA_DEFAULT << 2)        /**< Shifted mode DEFAULT for MPCP_CTRL2         */
#define MPCP_CTRL2_USECTEA_NO                 (_MPCP_CTRL2_USECTEA_NO << 2)             /**< Shifted mode NO for MPCP_CTRL2              */
#define MPCP_CTRL2_USECTEA_YES                (_MPCP_CTRL2_USECTEA_YES << 2)            /**< Shifted mode YES for MPCP_CTRL2             */
#define MPCP_CTRL2_USECTEB                    (0x1UL << 3)                              /**< New BitField                                */
#define _MPCP_CTRL2_USECTEB_SHIFT             3                                         /**< Shift value for MPCP_USECTEB                */
#define _MPCP_CTRL2_USECTEB_MASK              0x8UL                                     /**< Bit mask for MPCP_USECTEB                   */
#define _MPCP_CTRL2_USECTEB_DEFAULT           0x00000000UL                              /**< Mode DEFAULT for MPCP_CTRL2                 */
#define _MPCP_CTRL2_USECTEB_NO                0x00000000UL                              /**< Mode NO for MPCP_CTRL2                      */
#define _MPCP_CTRL2_USECTEB_YES               0x00000001UL                              /**< Mode YES for MPCP_CTRL2                     */
#define MPCP_CTRL2_USECTEB_DEFAULT            (_MPCP_CTRL2_USECTEB_DEFAULT << 3)        /**< Shifted mode DEFAULT for MPCP_CTRL2         */
#define MPCP_CTRL2_USECTEB_NO                 (_MPCP_CTRL2_USECTEB_NO << 3)             /**< Shifted mode NO for MPCP_CTRL2              */
#define MPCP_CTRL2_USECTEB_YES                (_MPCP_CTRL2_USECTEB_YES << 3)            /**< Shifted mode YES for MPCP_CTRL2             */
#define MPCP_CTRL2_USECTEC                    (0x1UL << 4)                              /**< New BitField                                */
#define _MPCP_CTRL2_USECTEC_SHIFT             4                                         /**< Shift value for MPCP_USECTEC                */
#define _MPCP_CTRL2_USECTEC_MASK              0x10UL                                    /**< Bit mask for MPCP_USECTEC                   */
#define _MPCP_CTRL2_USECTEC_DEFAULT           0x00000000UL                              /**< Mode DEFAULT for MPCP_CTRL2                 */
#define _MPCP_CTRL2_USECTEC_NO                0x00000000UL                              /**< Mode NO for MPCP_CTRL2                      */
#define _MPCP_CTRL2_USECTEC_YES               0x00000001UL                              /**< Mode YES for MPCP_CTRL2                     */
#define MPCP_CTRL2_USECTEC_DEFAULT            (_MPCP_CTRL2_USECTEC_DEFAULT << 4)        /**< Shifted mode DEFAULT for MPCP_CTRL2         */
#define MPCP_CTRL2_USECTEC_NO                 (_MPCP_CTRL2_USECTEC_NO << 4)             /**< Shifted mode NO for MPCP_CTRL2              */
#define MPCP_CTRL2_USECTEC_YES                (_MPCP_CTRL2_USECTEC_YES << 4)            /**< Shifted mode YES for MPCP_CTRL2             */
#define MPCP_CTRL2_SUMRST                     (0x1UL << 5)                              /**< New BitField                                */
#define _MPCP_CTRL2_SUMRST_SHIFT              5                                         /**< Shift value for MPCP_SUMRST                 */
#define _MPCP_CTRL2_SUMRST_MASK               0x20UL                                    /**< Bit mask for MPCP_SUMRST                    */
#define _MPCP_CTRL2_SUMRST_DEFAULT            0x00000000UL                              /**< Mode DEFAULT for MPCP_CTRL2                 */
#define _MPCP_CTRL2_SUMRST_Disable            0x00000000UL                              /**< Mode Disable for MPCP_CTRL2                 */
#define _MPCP_CTRL2_SUMRST_Enable             0x00000001UL                              /**< Mode Enable for MPCP_CTRL2                  */
#define MPCP_CTRL2_SUMRST_DEFAULT             (_MPCP_CTRL2_SUMRST_DEFAULT << 5)         /**< Shifted mode DEFAULT for MPCP_CTRL2         */
#define MPCP_CTRL2_SUMRST_Disable             (_MPCP_CTRL2_SUMRST_Disable << 5)         /**< Shifted mode Disable for MPCP_CTRL2         */
#define MPCP_CTRL2_SUMRST_Enable              (_MPCP_CTRL2_SUMRST_Enable << 5)          /**< Shifted mode Enable for MPCP_CTRL2          */
#define MPCP_CTRL2_SUMSTORE                   (0x1UL << 6)                              /**< New BitField                                */
#define _MPCP_CTRL2_SUMSTORE_SHIFT            6                                         /**< Shift value for MPCP_SUMSTORE               */
#define _MPCP_CTRL2_SUMSTORE_MASK             0x40UL                                    /**< Bit mask for MPCP_SUMSTORE                  */
#define _MPCP_CTRL2_SUMSTORE_DEFAULT          0x00000000UL                              /**< Mode DEFAULT for MPCP_CTRL2                 */
#define _MPCP_CTRL2_SUMSTORE_No               0x00000000UL                              /**< Mode No for MPCP_CTRL2                      */
#define _MPCP_CTRL2_SUMSTORE_Yes              0x00000001UL                              /**< Mode Yes for MPCP_CTRL2                     */
#define MPCP_CTRL2_SUMSTORE_DEFAULT           (_MPCP_CTRL2_SUMSTORE_DEFAULT << 6)       /**< Shifted mode DEFAULT for MPCP_CTRL2         */
#define MPCP_CTRL2_SUMSTORE_No                (_MPCP_CTRL2_SUMSTORE_No << 6)            /**< Shifted mode No for MPCP_CTRL2              */
#define MPCP_CTRL2_SUMSTORE_Yes               (_MPCP_CTRL2_SUMSTORE_Yes << 6)           /**< Shifted mode Yes for MPCP_CTRL2             */
#define MPCP_CTRL2_USEWFORDEROT               (0x1UL << 7)                              /**< New BitField                                */
#define _MPCP_CTRL2_USEWFORDEROT_SHIFT        7                                         /**< Shift value for MPCP_USEWFORDEROT           */
#define _MPCP_CTRL2_USEWFORDEROT_MASK         0x80UL                                    /**< Bit mask for MPCP_USEWFORDEROT              */
#define _MPCP_CTRL2_USEWFORDEROT_DEFAULT      0x00000000UL                              /**< Mode DEFAULT for MPCP_CTRL2                 */
#define _MPCP_CTRL2_USEWFORDEROT_No           0x00000000UL                              /**< Mode No for MPCP_CTRL2                      */
#define _MPCP_CTRL2_USEWFORDEROT_Yes          0x00000001UL                              /**< Mode Yes for MPCP_CTRL2                     */
#define MPCP_CTRL2_USEWFORDEROT_DEFAULT       (_MPCP_CTRL2_USEWFORDEROT_DEFAULT << 7)   /**< Shifted mode DEFAULT for MPCP_CTRL2         */
#define MPCP_CTRL2_USEWFORDEROT_No            (_MPCP_CTRL2_USEWFORDEROT_No << 7)        /**< Shifted mode No for MPCP_CTRL2              */
#define MPCP_CTRL2_USEWFORDEROT_Yes           (_MPCP_CTRL2_USEWFORDEROT_Yes << 7)       /**< Shifted mode Yes for MPCP_CTRL2             */
#define _MPCP_CTRL2_NBACCU_SHIFT              8                                         /**< Shift value for MPCP_NBACCU                 */
#define _MPCP_CTRL2_NBACCU_MASK               0x1FFF00UL                                /**< Bit mask for MPCP_NBACCU                    */
#define _MPCP_CTRL2_NBACCU_DEFAULT            0x00000000UL                              /**< Mode DEFAULT for MPCP_CTRL2                 */
#define MPCP_CTRL2_NBACCU_DEFAULT             (_MPCP_CTRL2_NBACCU_DEFAULT << 8)         /**< Shifted mode DEFAULT for MPCP_CTRL2         */
#define _MPCP_CTRL2_NSTEP_SHIFT               21                                        /**< Shift value for MPCP_NSTEP                  */
#define _MPCP_CTRL2_NSTEP_MASK                0x7FE00000UL                              /**< Bit mask for MPCP_NSTEP                     */
#define _MPCP_CTRL2_NSTEP_DEFAULT             0x00000000UL                              /**< Mode DEFAULT for MPCP_CTRL2                 */
#define MPCP_CTRL2_NSTEP_DEFAULT              (_MPCP_CTRL2_NSTEP_DEFAULT << 21)         /**< Shifted mode DEFAULT for MPCP_CTRL2         */
#define MPCP_CTRL2_DEBUG                      (0x1UL << 31)                             /**< New BitField                                */
#define _MPCP_CTRL2_DEBUG_SHIFT               31                                        /**< Shift value for MPCP_DEBUG                  */
#define _MPCP_CTRL2_DEBUG_MASK                0x80000000UL                              /**< Bit mask for MPCP_DEBUG                     */
#define _MPCP_CTRL2_DEBUG_DEFAULT             0x00000000UL                              /**< Mode DEFAULT for MPCP_CTRL2                 */
#define _MPCP_CTRL2_DEBUG_NO                  0x00000000UL                              /**< Mode NO for MPCP_CTRL2                      */
#define _MPCP_CTRL2_DEBUG_YES                 0x00000001UL                              /**< Mode YES for MPCP_CTRL2                     */
#define MPCP_CTRL2_DEBUG_DEFAULT              (_MPCP_CTRL2_DEBUG_DEFAULT << 31)         /**< Shifted mode DEFAULT for MPCP_CTRL2         */
#define MPCP_CTRL2_DEBUG_NO                   (_MPCP_CTRL2_DEBUG_NO << 31)              /**< Shifted mode NO for MPCP_CTRL2              */
#define MPCP_CTRL2_DEBUG_YES                  (_MPCP_CTRL2_DEBUG_YES << 31)             /**< Shifted mode YES for MPCP_CTRL2             */

/* Bit fields for MPCP CTRL3 */
#define _MPCP_CTRL3_RESETVALUE                0x00000000UL                              /**< Default value for MPCP_CTRL3                */
#define _MPCP_CTRL3_MASK                      0xFFFFFFFFUL                              /**< Mask for MPCP_CTRL3                         */
#define _MPCP_CTRL3_F_SHIFT                   0                                         /**< Shift value for MPCP_F                      */
#define _MPCP_CTRL3_F_MASK                    0xFFFFUL                                  /**< Bit mask for MPCP_F                         */
#define _MPCP_CTRL3_F_DEFAULT                 0x00000000UL                              /**< Mode DEFAULT for MPCP_CTRL3                 */
#define MPCP_CTRL3_F_DEFAULT                  (_MPCP_CTRL3_F_DEFAULT << 0)              /**< Shifted mode DEFAULT for MPCP_CTRL3         */
#define _MPCP_CTRL3_PHI_SHIFT                 16                                        /**< Shift value for MPCP_PHI                    */
#define _MPCP_CTRL3_PHI_MASK                  0xFFFF0000UL                              /**< Bit mask for MPCP_PHI                       */
#define _MPCP_CTRL3_PHI_DEFAULT               0x00000000UL                              /**< Mode DEFAULT for MPCP_CTRL3                 */
#define MPCP_CTRL3_PHI_DEFAULT                (_MPCP_CTRL3_PHI_DEFAULT << 16)           /**< Shifted mode DEFAULT for MPCP_CTRL3         */

/* Bit fields for MPCP CTEA */
#define _MPCP_CTEA_RESETVALUE                 0x00000000UL                              /**< Default value for MPCP_CTEA                 */
#define _MPCP_CTEA_MASK                       0xFFFFFFFFUL                              /**< Mask for MPCP_CTEA                          */
#define _MPCP_CTEA_I_SHIFT                    0                                         /**< Shift value for MPCP_I                      */
#define _MPCP_CTEA_I_MASK                     0xFFFFUL                                  /**< Bit mask for MPCP_I                         */
#define _MPCP_CTEA_I_DEFAULT                  0x00000000UL                              /**< Mode DEFAULT for MPCP_CTEA                  */
#define MPCP_CTEA_I_DEFAULT                   (_MPCP_CTEA_I_DEFAULT << 0)               /**< Shifted mode DEFAULT for MPCP_CTEA          */
#define _MPCP_CTEA_Q_SHIFT                    16                                        /**< Shift value for MPCP_Q                      */
#define _MPCP_CTEA_Q_MASK                     0xFFFF0000UL                              /**< Bit mask for MPCP_Q                         */
#define _MPCP_CTEA_Q_DEFAULT                  0x00000000UL                              /**< Mode DEFAULT for MPCP_CTEA                  */
#define MPCP_CTEA_Q_DEFAULT                   (_MPCP_CTEA_Q_DEFAULT << 16)              /**< Shifted mode DEFAULT for MPCP_CTEA          */

/* Bit fields for MPCP CTEB */
#define _MPCP_CTEB_RESETVALUE                 0x00000000UL                              /**< Default value for MPCP_CTEB                 */
#define _MPCP_CTEB_MASK                       0xFFFFFFFFUL                              /**< Mask for MPCP_CTEB                          */
#define _MPCP_CTEB_I_SHIFT                    0                                         /**< Shift value for MPCP_I                      */
#define _MPCP_CTEB_I_MASK                     0xFFFFUL                                  /**< Bit mask for MPCP_I                         */
#define _MPCP_CTEB_I_DEFAULT                  0x00000000UL                              /**< Mode DEFAULT for MPCP_CTEB                  */
#define MPCP_CTEB_I_DEFAULT                   (_MPCP_CTEB_I_DEFAULT << 0)               /**< Shifted mode DEFAULT for MPCP_CTEB          */
#define _MPCP_CTEB_Q_SHIFT                    16                                        /**< Shift value for MPCP_Q                      */
#define _MPCP_CTEB_Q_MASK                     0xFFFF0000UL                              /**< Bit mask for MPCP_Q                         */
#define _MPCP_CTEB_Q_DEFAULT                  0x00000000UL                              /**< Mode DEFAULT for MPCP_CTEB                  */
#define MPCP_CTEB_Q_DEFAULT                   (_MPCP_CTEB_Q_DEFAULT << 16)              /**< Shifted mode DEFAULT for MPCP_CTEB          */

