SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_mpcp.h
/* Bit fields for MPCP CTEC */
#define _MPCP_CTEC_RESETVALUE                 0x00000000UL                              /**< Default value for MPCP_CTEC                 */
#define _MPCP_CTEC_MASK                       0xFFFFFFFFUL                              /**< Mask for MPCP_CTEC                          */
#define _MPCP_CTEC_I_SHIFT                    0                                         /**< Shift value for MPCP_I                      */
#define _MPCP_CTEC_I_MASK                     0xFFFFUL                                  /**< Bit mask for MPCP_I                         */
#define _MPCP_CTEC_I_DEFAULT                  0x00000000UL                              /**< Mode DEFAULT for MPCP_CTEC                  */
#define MPCP_CTEC_I_DEFAULT                   (_MPCP_CTEC_I_DEFAULT << 0)               /**< Shifted mode DEFAULT for MPCP_CTEC          */
#define _MPCP_CTEC_Q_SHIFT                    16                                        /**< Shift value for MPCP_Q                      */
#define _MPCP_CTEC_Q_MASK                     0xFFFF0000UL                              /**< Bit mask for MPCP_Q                         */
#define _MPCP_CTEC_Q_DEFAULT                  0x00000000UL                              /**< Mode DEFAULT for MPCP_CTEC                  */
#define MPCP_CTEC_Q_DEFAULT                   (_MPCP_CTEC_Q_DEFAULT << 16)              /**< Shifted mode DEFAULT for MPCP_CTEC          */

/* Bit fields for MPCP BYPASS */
#define _MPCP_BYPASS_RESETVALUE               0x00000000UL                              /**< Default value for MPCP_BYPASS               */
#define _MPCP_BYPASS_MASK                     0x0000001FUL                              /**< Mask for MPCP_BYPASS                        */
#define _MPCP_BYPASS_BYPASS_SHIFT             0                                         /**< Shift value for MPCP_BYPASS                 */
#define _MPCP_BYPASS_BYPASS_MASK              0x1FUL                                    /**< Bit mask for MPCP_BYPASS                    */
#define _MPCP_BYPASS_BYPASS_DEFAULT           0x00000000UL                              /**< Mode DEFAULT for MPCP_BYPASS                */
#define MPCP_BYPASS_BYPASS_DEFAULT            (_MPCP_BYPASS_BYPASS_DEFAULT << 0)        /**< Shifted mode DEFAULT for MPCP_BYPASS        */

/* Bit fields for MPCP STAT */
#define _MPCP_STAT_RESETVALUE                 0x00000000UL                              /**< Default value for MPCP_STAT                 */
#define _MPCP_STAT_MASK                       0xFFFFFFFFUL                              /**< Mask for MPCP_STAT                          */
#define _MPCP_STAT_RESI_SHIFT                 0                                         /**< Shift value for MPCP_RESI                   */
#define _MPCP_STAT_RESI_MASK                  0xFFFFUL                                  /**< Bit mask for MPCP_RESI                      */
#define _MPCP_STAT_RESI_DEFAULT               0x00000000UL                              /**< Mode DEFAULT for MPCP_STAT                  */
#define MPCP_STAT_RESI_DEFAULT                (_MPCP_STAT_RESI_DEFAULT << 0)            /**< Shifted mode DEFAULT for MPCP_STAT          */
#define _MPCP_STAT_RESQ_SHIFT                 16                                        /**< Shift value for MPCP_RESQ                   */
#define _MPCP_STAT_RESQ_MASK                  0xFFFF0000UL                              /**< Bit mask for MPCP_RESQ                      */
#define _MPCP_STAT_RESQ_DEFAULT               0x00000000UL                              /**< Mode DEFAULT for MPCP_STAT                  */
#define MPCP_STAT_RESQ_DEFAULT                (_MPCP_STAT_RESQ_DEFAULT << 16)           /**< Shifted mode DEFAULT for MPCP_STAT          */

/* Bit fields for MPCP CTRL4 */
#define _MPCP_CTRL4_RESETVALUE                0x00000000UL                              /**< Default value for MPCP_CTRL4                */
#define _MPCP_CTRL4_MASK                      0xFFFFFFFFUL                              /**< Mask for MPCP_CTRL4                         */
#define _MPCP_CTRL4_OUTGAIN_SHIFT             0                                         /**< Shift value for MPCP_OUTGAIN                */
#define _MPCP_CTRL4_OUTGAIN_MASK              0x7FUL                                    /**< Bit mask for MPCP_OUTGAIN                   */
#define _MPCP_CTRL4_OUTGAIN_DEFAULT           0x00000000UL                              /**< Mode DEFAULT for MPCP_CTRL4                 */
#define MPCP_CTRL4_OUTGAIN_DEFAULT            (_MPCP_CTRL4_OUTGAIN_DEFAULT << 0)        /**< Shifted mode DEFAULT for MPCP_CTRL4         */
#define _MPCP_CTRL4_SHIFTDIVOUT_SHIFT         7                                         /**< Shift value for MPCP_SHIFTDIVOUT            */
#define _MPCP_CTRL4_SHIFTDIVOUT_MASK          0x1F80UL                                  /**< Bit mask for MPCP_SHIFTDIVOUT               */
#define _MPCP_CTRL4_SHIFTDIVOUT_DEFAULT       0x00000000UL                              /**< Mode DEFAULT for MPCP_CTRL4                 */
#define MPCP_CTRL4_SHIFTDIVOUT_DEFAULT        (_MPCP_CTRL4_SHIFTDIVOUT_DEFAULT << 7)    /**< Shifted mode DEFAULT for MPCP_CTRL4         */
#define _MPCP_CTRL4_DECIMOUT_SHIFT            13                                        /**< Shift value for MPCP_DECIMOUT               */
#define _MPCP_CTRL4_DECIMOUT_MASK             0x3FFE000UL                               /**< Bit mask for MPCP_DECIMOUT                  */
#define _MPCP_CTRL4_DECIMOUT_DEFAULT          0x00000000UL                              /**< Mode DEFAULT for MPCP_CTRL4                 */
#define MPCP_CTRL4_DECIMOUT_DEFAULT           (_MPCP_CTRL4_DECIMOUT_DEFAULT << 13)      /**< Shifted mode DEFAULT for MPCP_CTRL4         */
#define _MPCP_CTRL4_SHIFT2_SHIFT              26                                        /**< Shift value for MPCP_SHIFT2                 */
#define _MPCP_CTRL4_SHIFT2_MASK               0xFC000000UL                              /**< Bit mask for MPCP_SHIFT2                    */
#define _MPCP_CTRL4_SHIFT2_DEFAULT            0x00000000UL                              /**< Mode DEFAULT for MPCP_CTRL4                 */
#define MPCP_CTRL4_SHIFT2_DEFAULT             (_MPCP_CTRL4_SHIFT2_DEFAULT << 26)        /**< Shifted mode DEFAULT for MPCP_CTRL4         */

