SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_mpcp.h
/* Bit fields for MPCP IF */
#define _MPCP_IF_RESETVALUE                   0x00000000UL                              /**< Default value for MPCP_IF                   */
#define _MPCP_IF_MASK                         0x00000001UL                              /**< Mask for MPCP_IF                            */
#define MPCP_IF_MPCP                          (0x1UL << 0)                              /**< MPCP Interrupt Flag                         */
#define _MPCP_IF_MPCP_SHIFT                   0                                         /**< Shift value for MPCP_MPCP                   */
#define _MPCP_IF_MPCP_MASK                    0x1UL                                     /**< Bit mask for MPCP_MPCP                      */
#define _MPCP_IF_MPCP_DEFAULT                 0x00000000UL                              /**< Mode DEFAULT for MPCP_IF                    */
#define MPCP_IF_MPCP_DEFAULT                  (_MPCP_IF_MPCP_DEFAULT << 0)              /**< Shifted mode DEFAULT for MPCP_IF            */

/* Bit fields for MPCP IEN */
#define _MPCP_IEN_RESETVALUE                  0x00000000UL                              /**< Default value for MPCP_IEN                  */
#define _MPCP_IEN_MASK                        0x00000001UL                              /**< Mask for MPCP_IEN                           */
#define MPCP_IEN_MPCP                         (0x1UL << 0)                              /**< MPCP Interrupt enable                       */
#define _MPCP_IEN_MPCP_SHIFT                  0                                         /**< Shift value for MPCP_MPCP                   */
#define _MPCP_IEN_MPCP_MASK                   0x1UL                                     /**< Bit mask for MPCP_MPCP                      */
#define _MPCP_IEN_MPCP_DEFAULT                0x00000000UL                              /**< Mode DEFAULT for MPCP_IEN                   */
#define MPCP_IEN_MPCP_DEFAULT                 (_MPCP_IEN_MPCP_DEFAULT << 0)             /**< Shifted mode DEFAULT for MPCP_IEN           */

/* Bit fields for MPCP CTRL5 */
#define _MPCP_CTRL5_RESETVALUE                0x00000000UL                              /**< Default value for MPCP_CTRL5                */
#define _MPCP_CTRL5_MASK                      0xFC000FFFUL                              /**< Mask for MPCP_CTRL5                         */
#define _MPCP_CTRL5_SEARCHMINMAX_SHIFT        0                                         /**< Shift value for MPCP_SEARCHMINMAX           */
#define _MPCP_CTRL5_SEARCHMINMAX_MASK         0x3UL                                     /**< Bit mask for MPCP_SEARCHMINMAX              */
#define _MPCP_CTRL5_SEARCHMINMAX_DEFAULT      0x00000000UL                              /**< Mode DEFAULT for MPCP_CTRL5                 */
#define _MPCP_CTRL5_SEARCHMINMAX_NO           0x00000000UL                              /**< Mode NO for MPCP_CTRL5                      */
#define _MPCP_CTRL5_SEARCHMINMAX_MIN          0x00000001UL                              /**< Mode MIN for MPCP_CTRL5                     */
#define _MPCP_CTRL5_SEARCHMINMAX_MAX          0x00000002UL                              /**< Mode MAX for MPCP_CTRL5                     */
#define MPCP_CTRL5_SEARCHMINMAX_DEFAULT       (_MPCP_CTRL5_SEARCHMINMAX_DEFAULT << 0)   /**< Shifted mode DEFAULT for MPCP_CTRL5         */
#define MPCP_CTRL5_SEARCHMINMAX_NO            (_MPCP_CTRL5_SEARCHMINMAX_NO << 0)        /**< Shifted mode NO for MPCP_CTRL5              */
#define MPCP_CTRL5_SEARCHMINMAX_MIN           (_MPCP_CTRL5_SEARCHMINMAX_MIN << 0)       /**< Shifted mode MIN for MPCP_CTRL5             */
#define MPCP_CTRL5_SEARCHMINMAX_MAX           (_MPCP_CTRL5_SEARCHMINMAX_MAX << 0)       /**< Shifted mode MAX for MPCP_CTRL5             */
#define MPCP_CTRL5_SEARCHPATH                 (0x1UL << 2)                              /**< New BitField                                */
#define _MPCP_CTRL5_SEARCHPATH_SHIFT          2                                         /**< Shift value for MPCP_SEARCHPATH             */
#define _MPCP_CTRL5_SEARCHPATH_MASK           0x4UL                                     /**< Bit mask for MPCP_SEARCHPATH                */
#define _MPCP_CTRL5_SEARCHPATH_DEFAULT        0x00000000UL                              /**< Mode DEFAULT for MPCP_CTRL5                 */
#define _MPCP_CTRL5_SEARCHPATH_IQ             0x00000000UL                              /**< Mode IQ for MPCP_CTRL5                      */
#define _MPCP_CTRL5_SEARCHPATH_ACCU           0x00000001UL                              /**< Mode ACCU for MPCP_CTRL5                    */
#define MPCP_CTRL5_SEARCHPATH_DEFAULT         (_MPCP_CTRL5_SEARCHPATH_DEFAULT << 2)     /**< Shifted mode DEFAULT for MPCP_CTRL5         */
#define MPCP_CTRL5_SEARCHPATH_IQ              (_MPCP_CTRL5_SEARCHPATH_IQ << 2)          /**< Shifted mode IQ for MPCP_CTRL5              */
#define MPCP_CTRL5_SEARCHPATH_ACCU            (_MPCP_CTRL5_SEARCHPATH_ACCU << 2)        /**< Shifted mode ACCU for MPCP_CTRL5            */
#define MPCP_CTRL5_SEARCHAFTERABS             (0x1UL << 3)                              /**< New BitField                                */
#define _MPCP_CTRL5_SEARCHAFTERABS_SHIFT      3                                         /**< Shift value for MPCP_SEARCHAFTERABS         */
#define _MPCP_CTRL5_SEARCHAFTERABS_MASK       0x8UL                                     /**< Bit mask for MPCP_SEARCHAFTERABS            */
#define _MPCP_CTRL5_SEARCHAFTERABS_DEFAULT    0x00000000UL                              /**< Mode DEFAULT for MPCP_CTRL5                 */
#define _MPCP_CTRL5_SEARCHAFTERABS_NO         0x00000000UL                              /**< Mode NO for MPCP_CTRL5                      */
#define _MPCP_CTRL5_SEARCHAFTERABS_YES        0x00000001UL                              /**< Mode YES for MPCP_CTRL5                     */
#define MPCP_CTRL5_SEARCHAFTERABS_DEFAULT     (_MPCP_CTRL5_SEARCHAFTERABS_DEFAULT << 3) /**< Shifted mode DEFAULT for MPCP_CTRL5         */
#define MPCP_CTRL5_SEARCHAFTERABS_NO          (_MPCP_CTRL5_SEARCHAFTERABS_NO << 3)      /**< Shifted mode NO for MPCP_CTRL5              */
#define MPCP_CTRL5_SEARCHAFTERABS_YES         (_MPCP_CTRL5_SEARCHAFTERABS_YES << 3)     /**< Shifted mode YES for MPCP_CTRL5             */
#define MPCP_CTRL5_SERIALOUTEN                (0x1UL << 4)                              /**< New BitField                                */
#define _MPCP_CTRL5_SERIALOUTEN_SHIFT         4                                         /**< Shift value for MPCP_SERIALOUTEN            */
#define _MPCP_CTRL5_SERIALOUTEN_MASK          0x10UL                                    /**< Bit mask for MPCP_SERIALOUTEN               */
#define _MPCP_CTRL5_SERIALOUTEN_DEFAULT       0x00000000UL                              /**< Mode DEFAULT for MPCP_CTRL5                 */
#define _MPCP_CTRL5_SERIALOUTEN_DISABLED      0x00000000UL                              /**< Mode DISABLED for MPCP_CTRL5                */
#define _MPCP_CTRL5_SERIALOUTEN_ENABLED       0x00000001UL                              /**< Mode ENABLED for MPCP_CTRL5                 */
#define MPCP_CTRL5_SERIALOUTEN_DEFAULT        (_MPCP_CTRL5_SERIALOUTEN_DEFAULT << 4)    /**< Shifted mode DEFAULT for MPCP_CTRL5         */
#define MPCP_CTRL5_SERIALOUTEN_DISABLED       (_MPCP_CTRL5_SERIALOUTEN_DISABLED << 4)   /**< Shifted mode DISABLED for MPCP_CTRL5        */
#define MPCP_CTRL5_SERIALOUTEN_ENABLED        (_MPCP_CTRL5_SERIALOUTEN_ENABLED << 4)    /**< Shifted mode ENABLED for MPCP_CTRL5         */
#define MPCP_CTRL5_USEBFORCOSIN               (0x1UL << 5)                              /**< New BitField                                */
#define _MPCP_CTRL5_USEBFORCOSIN_SHIFT        5                                         /**< Shift value for MPCP_USEBFORCOSIN           */
#define _MPCP_CTRL5_USEBFORCOSIN_MASK         0x20UL                                    /**< Bit mask for MPCP_USEBFORCOSIN              */
#define _MPCP_CTRL5_USEBFORCOSIN_DEFAULT      0x00000000UL                              /**< Mode DEFAULT for MPCP_CTRL5                 */
#define _MPCP_CTRL5_USEBFORCOSIN_NO           0x00000000UL                              /**< Mode NO for MPCP_CTRL5                      */
#define _MPCP_CTRL5_USEBFORCOSIN_YES          0x00000001UL                              /**< Mode YES for MPCP_CTRL5                     */
#define MPCP_CTRL5_USEBFORCOSIN_DEFAULT       (_MPCP_CTRL5_USEBFORCOSIN_DEFAULT << 5)   /**< Shifted mode DEFAULT for MPCP_CTRL5         */
#define MPCP_CTRL5_USEBFORCOSIN_NO            (_MPCP_CTRL5_USEBFORCOSIN_NO << 5)        /**< Shifted mode NO for MPCP_CTRL5              */
#define MPCP_CTRL5_USEBFORCOSIN_YES           (_MPCP_CTRL5_USEBFORCOSIN_YES << 5)       /**< Shifted mode YES for MPCP_CTRL5             */
#define MPCP_CTRL5_INAASINTEGER               (0x1UL << 6)                              /**< New BitField                                */
#define _MPCP_CTRL5_INAASINTEGER_SHIFT        6                                         /**< Shift value for MPCP_INAASINTEGER           */
#define _MPCP_CTRL5_INAASINTEGER_MASK         0x40UL                                    /**< Bit mask for MPCP_INAASINTEGER              */
#define _MPCP_CTRL5_INAASINTEGER_DEFAULT      0x00000000UL                              /**< Mode DEFAULT for MPCP_CTRL5                 */
#define _MPCP_CTRL5_INAASINTEGER_NO           0x00000000UL                              /**< Mode NO for MPCP_CTRL5                      */
#define _MPCP_CTRL5_INAASINTEGER_YES          0x00000001UL                              /**< Mode YES for MPCP_CTRL5                     */
#define MPCP_CTRL5_INAASINTEGER_DEFAULT       (_MPCP_CTRL5_INAASINTEGER_DEFAULT << 6)   /**< Shifted mode DEFAULT for MPCP_CTRL5         */
#define MPCP_CTRL5_INAASINTEGER_NO            (_MPCP_CTRL5_INAASINTEGER_NO << 6)        /**< Shifted mode NO for MPCP_CTRL5              */
#define MPCP_CTRL5_INAASINTEGER_YES           (_MPCP_CTRL5_INAASINTEGER_YES << 6)       /**< Shifted mode YES for MPCP_CTRL5             */
#define _MPCP_CTRL5_SHIFTINA_SHIFT            7                                         /**< Shift value for MPCP_SHIFTINA               */
#define _MPCP_CTRL5_SHIFTINA_MASK             0xF80UL                                   /**< Bit mask for MPCP_SHIFTINA                  */
#define _MPCP_CTRL5_SHIFTINA_DEFAULT          0x00000000UL                              /**< Mode DEFAULT for MPCP_CTRL5                 */
#define _MPCP_CTRL5_SHIFTINA_NO               0x00000000UL                              /**< Mode NO for MPCP_CTRL5                      */
#define _MPCP_CTRL5_SHIFTINA_YES              0x00000001UL                              /**< Mode YES for MPCP_CTRL5                     */
#define MPCP_CTRL5_SHIFTINA_DEFAULT           (_MPCP_CTRL5_SHIFTINA_DEFAULT << 7)       /**< Shifted mode DEFAULT for MPCP_CTRL5         */
#define MPCP_CTRL5_SHIFTINA_NO                (_MPCP_CTRL5_SHIFTINA_NO << 7)            /**< Shifted mode NO for MPCP_CTRL5              */
#define MPCP_CTRL5_SHIFTINA_YES               (_MPCP_CTRL5_SHIFTINA_YES << 7)           /**< Shifted mode YES for MPCP_CTRL5             */
#define _MPCP_CTRL5_SHIFT3_SHIFT              26                                        /**< Shift value for MPCP_SHIFT3                 */
#define _MPCP_CTRL5_SHIFT3_MASK               0xFC000000UL                              /**< Bit mask for MPCP_SHIFT3                    */
#define _MPCP_CTRL5_SHIFT3_DEFAULT            0x00000000UL                              /**< Mode DEFAULT for MPCP_CTRL5                 */
#define MPCP_CTRL5_SHIFT3_DEFAULT             (_MPCP_CTRL5_SHIFT3_DEFAULT << 26)        /**< Shifted mode DEFAULT for MPCP_CTRL5         */

