SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_mpcp.h
/* Bit fields for MPCP MINMAXI */
#define _MPCP_MINMAXI_RESETVALUE              0x00000000UL                              /**< Default value for MPCP_MINMAXI              */
#define _MPCP_MINMAXI_MASK                    0xFFFFFFFFUL                              /**< Mask for MPCP_MINMAXI                       */
#define _MPCP_MINMAXI_MINMAXI_SHIFT           0                                         /**< Shift value for MPCP_MINMAXI                */
#define _MPCP_MINMAXI_MINMAXI_MASK            0xFFFFFFFFUL                              /**< Bit mask for MPCP_MINMAXI                   */
#define _MPCP_MINMAXI_MINMAXI_DEFAULT         0x00000000UL                              /**< Mode DEFAULT for MPCP_MINMAXI               */
#define MPCP_MINMAXI_MINMAXI_DEFAULT          (_MPCP_MINMAXI_MINMAXI_DEFAULT << 0)      /**< Shifted mode DEFAULT for MPCP_MINMAXI       */

/* Bit fields for MPCP MINMAXQ */
#define _MPCP_MINMAXQ_RESETVALUE              0x00000000UL                              /**< Default value for MPCP_MINMAXQ              */
#define _MPCP_MINMAXQ_MASK                    0xFFFFFF00UL                              /**< Mask for MPCP_MINMAXQ                       */
#define _MPCP_MINMAXQ_MINMAXQ_SHIFT           8                                         /**< Shift value for MPCP_MINMAXQ                */
#define _MPCP_MINMAXQ_MINMAXQ_MASK            0xFFFFFF00UL                              /**< Bit mask for MPCP_MINMAXQ                   */
#define _MPCP_MINMAXQ_MINMAXQ_DEFAULT         0x00000000UL                              /**< Mode DEFAULT for MPCP_MINMAXQ               */
#define MPCP_MINMAXQ_MINMAXQ_DEFAULT          (_MPCP_MINMAXQ_MINMAXQ_DEFAULT << 8)      /**< Shifted mode DEFAULT for MPCP_MINMAXQ       */

/* Bit fields for MPCP MINMAXIDX */
#define _MPCP_MINMAXIDX_RESETVALUE            0x00000000UL                               /**< Default value for MPCP_MINMAXIDX            */
#define _MPCP_MINMAXIDX_MASK                  0xFFFFFFFFUL                               /**< Mask for MPCP_MINMAXIDX                     */
#define _MPCP_MINMAXIDX_MINMAXIDXI_SHIFT      0                                          /**< Shift value for MPCP_MINMAXIDXI             */
#define _MPCP_MINMAXIDX_MINMAXIDXI_MASK       0xFFFFUL                                   /**< Bit mask for MPCP_MINMAXIDXI                */
#define _MPCP_MINMAXIDX_MINMAXIDXI_DEFAULT    0x00000000UL                               /**< Mode DEFAULT for MPCP_MINMAXIDX             */
#define MPCP_MINMAXIDX_MINMAXIDXI_DEFAULT     (_MPCP_MINMAXIDX_MINMAXIDXI_DEFAULT << 0)  /**< Shifted mode DEFAULT for MPCP_MINMAXIDX     */
#define _MPCP_MINMAXIDX_MINMAXIDXQ_SHIFT      16                                         /**< Shift value for MPCP_MINMAXIDXQ             */
#define _MPCP_MINMAXIDX_MINMAXIDXQ_MASK       0xFFFF0000UL                               /**< Bit mask for MPCP_MINMAXIDXQ                */
#define _MPCP_MINMAXIDX_MINMAXIDXQ_DEFAULT    0x00000000UL                               /**< Mode DEFAULT for MPCP_MINMAXIDX             */
#define MPCP_MINMAXIDX_MINMAXIDXQ_DEFAULT     (_MPCP_MINMAXIDX_MINMAXIDXQ_DEFAULT << 16) /**< Shifted mode DEFAULT for MPCP_MINMAXIDX     */

/** @} End of group EFR32FG25_MPCP_BitFields */
/** @} End of group EFR32FG25_MPCP */
/** @} End of group Parts */

#endif /* EFR32FG25_MPCP_H */
